slides/hofs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HOFs</title>
<!-- 2014-01-24 Fri 16:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Matt Field" />
</head>
<body>
<div id="content">
<h1 class="title">HOFs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Higher-Order Functions (20 minutes)</a>
<ul>
<li><a href="#sec-1-1">1.1. What are they?</a></li>
<li><a href="#sec-1-2">1.2. How do they work?</a></li>
<li><a href="#sec-1-3">1.3. Why would we use them?</a></li>
<li><a href="#sec-1-4">1.4. Familiar examples</a></li>
<li><a href="#sec-1-5">1.5. Making our own</a></li>
<li><a href="#sec-1-6">1.6. Your Turn!</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Higher-Order Functions (20 minutes)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Look at problems and create HOF(s) to simplify
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What are they?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Higher-order functions are functions that do at least one of the following:
<ol class="org-ol">
<li>Take one or more functions as input
</li>
<li>Return a function as their result
</li>
</ol>
</li>
<li>Lend themselves to a more functional, declarative style of programming vs
imperative, step-by-step definition (e.g. <code>map</code> vs <code>for</code> loops)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How do they work?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>JS has first-class fns!
</li>
<li>Can be passed as arguments, returned from functions and stored in variables
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Why would we use them?</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>HOFs grant us a powerful level of abstraction
</li>
<li>Combine elements of our programs into shorter, more meaningful blocks of code
that can themselves be combined and used as building blocks
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Familiar examples</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>canonical examples of HOFs: <code>map</code>, <code>filter</code>, <code>reduce</code>
</li>
<li>take a quick look at how they work with our own implementations
</li>

<li id="map"><code>map</code> works by taking an array of items and applying a function to each item
in that array. <code>map</code> then returns a <b>new</b> array whose items are the result.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function map(xs, fn){
  var arr = [];
  for (var i = 0; i &lt; xs.length; i++) {
    arr.push(fn(xs[i]));    
  }
  return arr;
}

map(["an", "array", "of", "strings"], function(word){
  return word.toUppercase();
});
//=&gt; ["AN", "ARRAY", "OF", "STRINGS"]
</pre>
</div>

<dl class="org-dl">
<dt> filter </dt><dd><code>filter</code> works by taking an array of items and appying a predicate function (a function
that returns either <code>true</code> or <code>false</code>) to each of them. Returns a list of those items
that satisfy the predicate.
</dd>
</dl>

<div class="org-src-container">

<pre class="src src-js">function filter(xs, pred){
  var filtered = [];
  for (var i = 0; i &lt; xs.length; i++) {
    var item = xs[i];
    if (pred(item)) filtered.push(item);
  }
  return filtered;
}

filter(["one", 2, 3, "four", "five", 6], function(item){
  return _.isNumber(item);
});
//=&gt; [2, 3, 6]
</pre>
</div>

<dl class="org-dl">
<dt> reduce </dt><dd><code>reduce</code> applies a function against an accumulated value and each value of an array, from left-to-right, 
and reduces down to a single value.
</dd>
</dl>

<div class="org-src-container">

<pre class="src src-js">function reduce(xs, fn, initial){
  var result = initial;
  for (var i = 0; i &lt; xs.length; i++) {
    result = fn(result, xs[i]);
  }
  return result;
}

function add(a, b){ return a + b; }

reduce([1,2,3,4,5], add, 0);
//=&gt; 15
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js">// Or, a slightly more interesting example

function flatten(a, b){
  return a.concat(b);
}

reduce([[0, 1], [2, 3], [4, 5]], flatten, []);
//=&gt; [0, 1, 2, 3, 4, 5]
</pre>
</div>

<ul class="org-ul">
<li>Might also hear reduction referred to as a <code>fold</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Making our own</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>HOFs give us a powerful abstraction mechanism
</li>
<li>Create our own descriptive building blocks and helpful utility methods
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function getText(el){ return el.innerText }

var links = document.getElementsByClassName('link');

map(links, getText);
//=&gt; ["Home", "About", "Blog", "Contact"]
</pre>
</div>

<ul class="org-ul">
<li>Instead of passing a function into `map`, could write 
a HOF that instead takes a function and turns into a mapping 
using `splat`
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function splat(fn){
  return function(xs){
    return Array.prototype.map.call(list, fn);
  }
}

// Create a new mapping function from `pluck`:
var mapGetText = splat(getText);

mapGetText(links);
//=&gt; ["Home", "About", "Blog", "Contact"]
</pre>
</div>

<ul class="org-ul">
<li>If we didn't use `splat`, we'd have to write something like this out
every time we wanted to construct a function that maps an array to a result:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function mapGetText(xs){
  return xs.map(function(x){
    return x.innerText;
  });
}
</pre>
</div>

<ul class="org-ul">
<li>Working on arrays up until now; what about objects?
</li>
<li>Very simple function, `get`, takes the name of a property and returns a function 
that gets that property from an object:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function get(prop){
  return function(object){
    return object[prop];
  };
}

var user = {
  'name': 'John',
  'age': 32,
  'location': 'London'
};

get('location')(user);
//=&gt; 'London'
</pre>
</div>

<ul class="org-ul">
<li>Probably dealing with an array of users (JSON?):
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">var users = [
  { 'name': 'John', 'age': 32, 'location': 'London' },
  { 'name': 'Wendy', 'age': 19, 'location': 'Amsterdam' },
  { 'name': 'Sheila', 'age': 41, 'location': 'New York' }
];
</pre>
</div>

<ul class="org-ul">
<li>Now we can make our earlier `splat` function work for us:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">var firstNames = splat(get('name'))(users);
//=&gt; ["John", "Wendy", "Sheila"]

// Which is nicer that writing:
var firstNames = splat(function(user){
  return user.name
})(users);
</pre>
</div>

<ul class="org-ul">
<li>Such a common pattern that we can take things up another level:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">function pluck(prop){
  return splat(get(prop));
}

pluck('name')(users);
//=&gt; ["John", "Wendy", "Sheila"]
</pre>
</div>

<ul class="org-ul">
<li>Libraries like Lo-Dash implement this in slightly different format:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">_.pluck(users, 'name');
//=&gt; ["John", "Wendy", "Sheila"]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Your Turn!</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-01-24 Fri&gt;</span></span></p>
<p class="author">Author: Matt Field</p>
<p class="date">Created: 2014-01-24 Fri 16:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
